//============================================================
//
//	銃ヘッダー [gun.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _GUN_H_
#define _GUN_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "object3D.h"

//************************************************************
//	前方宣言
//************************************************************
class CPlayer;	// プレイヤークラス

//************************************************************
//	クラス定義
//************************************************************
// 銃クラス
class CGun : public CObject3D
{
public:
	// コンストラクタ
	CGun();

	// デストラクタ
	~CGun();

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
	void Draw(CShader *pShader = nullptr) override;	// 描画

	// 静的メンバ関数
	static CGun *Create(CPlayer* pParent);	// 生成

private:
	// オーバーライド関数
	void CalcDrawMatrix(void) override;	// 描画マトリックス計算

	// メンバ変数
	CPlayer* m_pParent;	// 親の情報
	float m_fWaitTime;	// 待機時間
};

#endif	// _GUN_H_
