//==========================================================================
// 
//  利き手表示用ボールヘッダー [ballFake.h]
//  Author : 藤田勇一
// 
//==========================================================================

#ifndef _BALL_FAKE_H_
#define _BALL_FAKE_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "ball.h"

//==========================================================================
// クラス定義
//==========================================================================
// 利き手表示用ボールクラス定義
class CBallFake : public CBall
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CBallFake();
	~CBallFake();

	//=============================
	// オーバーライド関数
	//=============================
	virtual HRESULT Init() override;
	virtual void Uninit() override;
	virtual void Kill() override;
	virtual void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate) override;
	virtual void Draw() override;

	//=============================
	// 静的メンバ関数
	//=============================
	static CBallFake *Create();

	//=============================
	// メンバ関数
	//=============================
	inline void Drop(CPlayer* pPlayer) { Throw(pPlayer); }
};

#endif
