//==========================================================================
// 
//  ボール着地点マーカーヘッダー [ballLandingMarker.h]
//  Author : 藤田勇一
// 
//==========================================================================

#ifndef _BALL_MARKER_H_
#define _BALL_MARKER_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "object3D.h"

//==========================================================================
// 前方宣言
//==========================================================================
class CBall;

//==========================================================================
// クラス定義
//==========================================================================
// ボール着地点マーカークラス
class CBallLandingMarker : public CObject3D
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CBallLandingMarker(int nPriority = 7);
	~CBallLandingMarker();

	//=============================
	// オーバーライド関数
	//=============================
	virtual HRESULT Init() override;
	virtual void Uninit() override;
	virtual void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate) override;
	virtual void Draw() override;
	virtual void Kill() override;	// 削除

	//=============================
	// メンバ関数
	//=============================
	void BindBall(CBall* pBall) { m_pBall = pBall; }	// ボール割当

	//=============================
	// 静的メンバ関数
	//=============================
	static CBallLandingMarker* Create(CBall* pBall);	// 生成

private:

	//=============================
	// メンバ変数
	//=============================
	CBall* m_pBall;	// 親ボール情報
};

#endif
