//==========================================================================
// 
//  割当キー基底ヘッダー [bindKey.h]
//  Author : 藤田勇一
// 
//==========================================================================

#ifndef _BIND_KEY_H_
#define _BIND_KEY_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "player.h"

//==========================================================================
// クラス定義
//==========================================================================
// 割当キー基底クラス
class CBindKey
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CBindKey();
	virtual ~CBindKey();

	//=============================
	// 純粋仮想関数
	//=============================
	virtual bool IsPress(const int nPadIdx) const = 0;		// 割当キープレス取得
	virtual bool IsTrigger(const int nPadIdx) const = 0;	// 割当キートリガー取得
	virtual bool IsStickTilt(const int nPadIdx) const = 0;	// 割当スティック傾き取得
	virtual float GetRotation() const = 0;					// 割当キー向き取得
	virtual CPlayer::EDashAngle GetAngle() const = 0;		// 割当キー方向列挙取得
};

#endif
