//==========================================================================
// 
//  モテ文字ヘッダー [charmText.h]
//  Author : 相馬靜雅
// 
//==========================================================================

#ifndef _CHARMTEXT_H_
#define _CHARMTEXT_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "object.h"

//==========================================================================
// 前方宣言
//==========================================================================

//==========================================================================
// クラス定義
//==========================================================================
// モテ文字クラス
class CCharmText : public CObject
{
public:

	//=============================
	// 列挙型定義
	//=============================
	enum EState
	{
		STATE_FADEIN = 0,	// フェードイン
		STATE_WAIT,			// 待機(モテチェイン可能)
		STATE_FADEOUT,		// フェードアウト
		STATE_MAX
	};

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CCharmText(int nPriority = mylib_const::PRIORITY_DEFAULT, const LAYER layer = LAYER::LAYER_2D);
	~CCharmText();

	//=============================
	// オーバーライド関数
	//=============================
	virtual HRESULT Init() override;
	virtual void Uninit() override;
	virtual void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate) override;
	virtual void Draw() override;
	virtual void Kill() override;						// 削除
	virtual void SetEnableDisp(bool bDisp) override;	// 描画状況設定

	//=============================
	// メンバ関数
	//=============================

	//=============================
	// 静的メンバ関数
	//=============================
	static CCharmText* Create();	// 生成

private:

	//=============================
	// メンバ変数
	//=============================
	HRESULT CreateFace();	// 顔アイコン生成
	HRESULT CreateText();	// 文字生成

	//=============================
	// メンバ変数
	//=============================
	CObject2D* m_pFace;		// 顔アイコン
	CObject2D* m_pText;		// 文字
	float m_fStateTime;		// 状態タイマー
};

#endif
