//==========================================================================
// 
//  モテ文字(左)ヘッダー [charmText_Left.h]
//  Author : 相馬靜雅
// 
//==========================================================================

#ifndef _CHARMTEXT_LEFT_H_
#define _CHARMTEXT_LEFT_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "charmText.h"
#include "listmanager.h"

//==========================================================================
// 前方宣言
//==========================================================================

//==========================================================================
// クラス定義
//==========================================================================
// モテ文字クラス
class CCharmText_Left : public CCharmText
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CCharmText_Left();
	~CCharmText_Left();

	//=============================
	// オーバーライド関数
	//=============================
	virtual HRESULT Init() override;
	virtual void Uninit() override;
	virtual void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate) override;

private:

	//=============================
	// メンバ関数
	//=============================
	// 状態関数
	void StateFadeIn() override;	// フェードイン
	void StateWait() override;		// 待機
	void StateFadeOut() override;	// フェードアウト

	//=============================
	// メンバ変数
	//=============================
	static CListManager<CCharmText_Left> m_List;	// リスト
};

#endif
