//=============================================================================
// 
//  プレイヤーステータス処理 [characterStatus.cpp]
//  Author : 相馬靜雅
// 
//=============================================================================
#include "characterStatus.h"

//==========================================================================
// コンストラクタ
//==========================================================================
CCharacterStatus::CCharacterStatus() :
	m_fVelocityNormal(0.0f),	// 通常移動速度
	m_fVelocityDash(0.0f),		// ダッシュ移動速度
	m_fVelocityBlink(0.0f),		// ブリンク移動速度
	m_fVelocityJump(0.0f),		// ジャンプ量
	m_fRadius(0.0f),			// 半径
	m_fHeight(0.0f),			// 身長
	m_nLife(0),					// 体力
	m_typeTeam(CGameManager::SIDE_NONE)	// チームサイド
{

}

//==========================================================================
// デストラクタ
//==========================================================================
CCharacterStatus::~CCharacterStatus()
{

}
