//=============================================================================
//
// モテマネージャ処理 [charmManager.h]
// Author : 相馬靜雅
//
//=============================================================================
#ifndef _CHARMMANAGER_H_		// このマクロ定義がされていなかったら
#define _CHARMMANAGER_H_		// 二重インクルード防止のマクロを定義する

//==========================================================================
// 前方宣言
//==========================================================================

//==========================================================================
// クラス定義
//==========================================================================
// モテマネージャクラス
class CCharmManager
{
public:

	//=============================
	// 列挙型定義
	//=============================
	enum EType
	{
		TYPE_HIT = 0,		// ヒット
		TYPE_JUSTCATCH,		// ジャストキャッチ
		TYPE_COVERCATCH,	// カバーキャッチ
		TYPE_DODGE,			// 回避
		TYPE_SPECIAL,		// スペシャル
		TYPE_MAX
	};

	CCharmManager();
	~CCharmManager();

	//=============================
	// メンバ関数
	//=============================
	virtual HRESULT Init();		// 初期化
	virtual void Uninit();		// 終了

	//--------------------------
	// その他
	//--------------------------
	virtual float GetAddValue(EType type);	// 加算量取得

	// 静的関数
	static CCharmManager* Create();	// 生成処理
	static CCharmManager* GetInstance() { return m_pThisPtr; }	// インスタンス取得

private:


	//=============================
	// メンバ変数
	//=============================
	float m_fAddValue[EType::TYPE_MAX];	// 加算量
	static CCharmManager* m_pThisPtr;	// 自身のポインタ
};

#endif