//=============================================================================
// 
// モテ値マネージャ処理 [charmValueManager.cpp]
// Author : 相馬靜雅
// 
//=============================================================================
#include "charmValueManager.h"
#include "manager.h"

//==========================================================================
// 定数定義
//==========================================================================
namespace
{
	const float ADDVALUE[CCharmValueManager::ETypeAdd::ADD_MAX] =	// 加算量
	{
		1.0f,	// ヒット
		2.0f,	// ジャストキャッチ
		3.0f,	// カバーキャッチ
		4.0f,	// 回避
		10.0f,	// スペシャル
		10.0f,	// スペシャルをキャッチした
	};

	const float SUBVALUE[CCharmValueManager::ETypeSub::SUB_MAX] =	// 減算量
	{
		1.0f,	// ライン越えて戻ってる最中にあたる
		2.0f,	// 端に逃げまくる
		3.0f,	// 走っていってライン越え(ボール所持)
		4.0f,	// ずっとボール持って投げない
		10.0f,	// スペシャルをキャッチされた
	};
}

//==========================================================================
// 静的メンバ変数
//==========================================================================
CCharmValueManager* CCharmValueManager::m_pThisPtr = nullptr;	// 自身のポインタ

//==========================================================================
// コンストラクタ
//==========================================================================
CCharmValueManager::CCharmValueManager()
{
	
}

//==========================================================================
// デストラクタ
//==========================================================================
CCharmValueManager::~CCharmValueManager()
{

}

//==========================================================================
// 生成処理
//==========================================================================
CCharmValueManager* CCharmValueManager::Create()
{
	if (m_pThisPtr != nullptr)
	{// 既にある場合
		return m_pThisPtr;
	}

	// メモリの確保
	m_pThisPtr = DEBUG_NEW CCharmValueManager;

	if (m_pThisPtr != nullptr)
	{
		// 初期化処理
		m_pThisPtr->Init();
	}

	return m_pThisPtr;
}

//==========================================================================
// 初期化処理
//==========================================================================
HRESULT CCharmValueManager::Init()
{
	for (int i = 0; i < CCharmValueManager::ETypeAdd::ADD_MAX; i++)
	{
		m_fAddValue[i] = ADDVALUE[i];
	}
	
	for (int i = 0; i < CCharmValueManager::ETypeSub::SUB_MAX; i++)
	{
		m_fSubValue[i] = SUBVALUE[i];
	}

	return S_OK;
}

//==========================================================================
// 終了処理
//==========================================================================
void CCharmValueManager::Uninit()
{
	delete m_pThisPtr;
	m_pThisPtr = nullptr;
}

//==========================================================================
// 加算量取得
//==========================================================================
float CCharmValueManager::GetAddValue(ETypeAdd type)
{
	// 範囲外
	if (ETypeAdd::ADD_MAX <= type) return 0.0f;

	return m_fAddValue[type];
}

//==========================================================================
// 加算量取得
//==========================================================================
float CCharmValueManager::GetSubValue(ETypeSub type)
{
	// 範囲外
	if (ETypeSub::SUB_MAX <= type) return 0.0f;

	return m_fSubValue[type];
}
