//=============================================================================
//
// 着せ替え(ユニフォーム)処理 [dressup_uniform.h]
// Author : 相馬靜雅
//
//=============================================================================
#ifndef _DRESSUP_UNIFORM_H_		// このマクロ定義がされていなかったら
#define _DRESSUP_UNIFORM_H_		// 二重インクルード防止のマクロを定義する

//==========================================================================
// インクルードファイル
//==========================================================================
#include "dressup.h"

//==========================================================================
// クラス定義
//==========================================================================
// 着せ替え(ユニフォーム)クラス
class CDressup_Uniform : public CDressup
{
public:

	CDressup_Uniform();
	~CDressup_Uniform();

	//=============================
	// メンバ関数
	//=============================
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate) override; // 更新
	virtual void ReRegist() override;	// 再割り当て

private:

	//=============================
	// メンバ関数
	//=============================
	// その他
	void Debug() override;

};

#endif