//=============================================================================
//
// 着せ替え(顔)処理 [dressup_face.h]
// Author : 相馬靜雅
//
//=============================================================================
#ifndef _DRESSUP_FACE_H_		// このマクロ定義がされていなかったら
#define _DRESSUP_FACE_H_		// 二重インクルード防止のマクロを定義する

//==========================================================================
// インクルードファイル
//==========================================================================
#include "dressup.h"

//==========================================================================
// クラス定義
//==========================================================================
// 着せ替え(顔)クラス
class CDressup_Face : public CDressup
{
public:

	CDressup_Face();
	~CDressup_Face();

	//=============================
	// メンバ関数
	//=============================
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate) override; // 更新

private:

	//=============================
	// メンバ関数
	//=============================
	// その他
	void Debug() override;

};

#endif