//=============================================================================
//
// ゲーム詳細設定処理 [entry_gameSetting.h]
// Author : 相馬靜雅
//
//=============================================================================
#ifndef _ENTRY_GAMESETTING_H_		// このマクロ定義がされていなかったら
#define _ENTRY_GAMESETTING_H_		// 二重インクルード防止のマクロを定義する

//==========================================================================
// インクルードファイル
//==========================================================================
#include "entryscene.h"

//==========================================================================
// 前方宣言
//==========================================================================
class CObjectChara;

//==========================================================================
// クラス定義
//==========================================================================
// ゲーム詳細設定クラス
class CEntry_GameSetting : public CEntryScene
{
public:

	CEntry_GameSetting();
	~CEntry_GameSetting();

	//=============================
	// メンバ関数
	//=============================
	virtual HRESULT Init() override;		// 初期化
	virtual void Uninit() override;		// 終了
	virtual void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate) override;	// 更新

	//--------------------------
	// その他
	//--------------------------
	virtual void Debug() override;

private:

};

#endif