//=============================================================================
//
// エントリーシーン処理 [entryscene.h]
// Author : 相馬靜雅
//
//=============================================================================
#ifndef _ENTRYSCENE_H_		// このマクロ定義がされていなかったら
#define _ENTRYSCENE_H_		// 二重インクルード防止のマクロを定義する

//==========================================================================
// インクルードファイル
//==========================================================================
#include "entry.h"
#include "gameManager.h"

//==========================================================================
// 前方宣言
//==========================================================================

//==========================================================================
// クラス定義
//==========================================================================
// エントリーシーンクラス
class CEntryScene
{
public:

	CEntryScene();
	~CEntryScene();

	//=============================
	// メンバ関数
	//=============================
	virtual HRESULT Init() = 0;		// 初期化
	virtual void Uninit() = 0;		// 終了
	virtual void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate);	// 更新

	//--------------------------
	// その他
	//--------------------------
	virtual CEntry_SetUpTeam* GetSetupTeam() { return nullptr; }	// チーム等の設定シーン取得
	virtual CEntry_Dressup* GetDressupTeam() { return nullptr; }	// ドレスアップ設定シーン取得
	virtual void Debug() = 0;

	static CEntryScene* Create(CEntry::ESceneType sceneType);	// 生成
private:

	//=============================
	// メンバ関数
	//=============================
	void Save();	// セーブ
	void Load();	// ロード

	//=============================
	// メンバ変数
	//=============================

};

#endif