//============================================================
//
//	ライト処理 [light.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "light.h"
#include "manager.h"
#include "renderer.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{
	const int PRIORITY = 7;	// 優先順位
}

//************************************************************
//	静的メンバ変数宣言
//************************************************************
int CLight::m_nNumLight = 0;	// ライトの総数

//************************************************************
//	親クラス [CLight] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CLight::CLight() : CObject(PRIORITY),
	m_nLightIdx	(m_nNumLight)	// 自身のライトインデックス
{
	// 構造体の要素をクリア
	ZeroMemory(&m_light, sizeof(D3DLIGHT9));

	// ライトの総数を加算
	m_nNumLight++;
}

//============================================================
//	デストラクタ
//============================================================
CLight::~CLight()
{
	// ライトの総数を減算
	m_nNumLight--;
}

//============================================================
//	初期化処理
//============================================================
HRESULT CLight::Init()
{
	// 構造体の要素をクリア
	ZeroMemory(&m_light, sizeof(D3DLIGHT9));

	// ライトを有効にする
	SetEnableLight(true);

	// オブジェクト種類をライトにする
	SetType(CObject::TYPE::TYPE_LIGHT);

	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CLight::Uninit()
{
	if (GET_RENDERER != nullptr)
	{ // レンダラーが破棄されていない場合

		// ライトを無効にする
		SetEnableLight(false);
	}

	// オブジェクトを破棄
	Release();
}

//============================================================
//	削除処理
//============================================================
void CLight::Kill()
{
	// 自身の終了
	Uninit();
}

//============================================================
//	更新処理
//============================================================
void CLight::Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate)
{

}

//============================================================
//	描画処理
//============================================================
void CLight::Draw()
{

}

//============================================================
//	種類の設定処理
//============================================================
void CLight::SetLightType(const D3DLIGHTTYPE type)
{
	// 種類の設定
	m_light.Type = type;

	// ライトに設定を反映
	GET_DEVICE->SetLight(m_nLightIdx, &m_light);
}

//============================================================
//	位置の設定処理
//============================================================
void CLight::SetPosition(const MyLib::Vector3& rPos)
{
	// 位置の設定
	m_light.Position = rPos;

	// ライトに設定を反映
	GET_DEVICE->SetLight(m_nLightIdx, &m_light);
}

//============================================================
//	方向の設定処理
//============================================================
void CLight::SetDirection(const MyLib::Vector3& rDir)
{
	MyLib::Vector3 dir = rDir;	// 方向

	// 方向の設定
	m_light.Direction = dir.Normal();	// 方向を正規化

	// ライトに設定を反映
	GET_DEVICE->SetLight(m_nLightIdx, &m_light);
}

//============================================================
//	光源範囲の設定処理
//============================================================
void CLight::SetRange(const float fRange)
{
	// 光源範囲の設定
	m_light.Range = fRange;

	// ライトに設定を反映
	GET_DEVICE->SetLight(m_nLightIdx, &m_light);
}

//============================================================
//	拡散光の設定処理
//============================================================
void CLight::SetDiffuse(const MyLib::Color& rCol)
{
	// 拡散光の設定
	m_light.Diffuse = rCol;

	// ライトに設定を反映
	GET_DEVICE->SetLight(m_nLightIdx, &m_light);
}

//============================================================
//	有効の設定処理
//============================================================
void CLight::SetEnableLight(const bool bLight)
{
	// ライトフラグを設定
	GET_DEVICE->LightEnable(m_nLightIdx, bLight);
}
