#if 0
//==========================================================================
// 
//  スポットライト処理 [lightspot.h]
//  Author : 藤田勇一
// 
//==========================================================================

#ifndef _LIGHT_SPOT_H_
#define _LIGHT_SPOT_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "main.h"

//==========================================================================
// クラス定義
//==========================================================================
// スポットライトクラス
class CLightSpot
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CLightSpot();
	~CLightSpot();

	//=============================
	// メンバ関数
	//=============================
	HRESULT Init();
	void Uninit();
	void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate);
	void UpdateSpotLightSpotDirection(MyLib::Vector3 vec);	// スポットスポットライトの向き更新

private:

	//=============================
	// メンバ変数
	//=============================
	D3DLIGHT9 m_light;	// スポットライト構造体
};

#endif
#endif