//=============================================================================
// 
//  数字(Billboard)処理 [number_Billboard.cpp]
//  Author : 相馬靜雅
// 
//=============================================================================
#include "number_Billboard.h"
#include "manager.h"
#include "renderer.h"

//==========================================================================
// コンストラクタ
//==========================================================================
CNumberBillboard::CNumberBillboard(int nPriority, const LAYER layer) : CNumber(nPriority, layer)
{
	// 値のクリア
	m_pObjBillboard = nullptr;			// オブジェクトBillboardのオブジェクト
}

//==========================================================================
// デストラクタ
//==========================================================================
CNumberBillboard::~CNumberBillboard()
{

}

//==========================================================================
// 初期化処理
//==========================================================================
HRESULT CNumberBillboard::Init()
{
	// 初期化処理
	CNumber::Init();

	// 生成処理
	m_pObjBillboard = CObjectBillboardAnim::Create(GetPosition(), 10, 1, 1.0f, false, GetPriority());
	
	// 自動再生停止
	m_pObjBillboard->SetEnableAutoPlay(false);

	return S_OK;
}

//==========================================================================
// 終了処理
//==========================================================================
void CNumberBillboard::Uninit()
{
	// 終了処理
	CNumber::Uninit();
}

//==========================================================================
// 削除処理
//==========================================================================
void CNumberBillboard::Kill()
{
	// 削除処理
	if (m_pObjBillboard != nullptr)
	{
		m_pObjBillboard->Kill();
		m_pObjBillboard = nullptr;
	}

	// 削除処理
	CNumber::Kill();
}

//==========================================================================
// 更新処理
//==========================================================================
void CNumberBillboard::Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate)
{
	// 頂点情報設定処理
	CNumberBillboard::SetVtx();
}

//==========================================================================
// 描画処理
//==========================================================================
void CNumberBillboard::Draw()
{
	
}

//==========================================================================
// 頂点情報設定処理
//==========================================================================
void CNumberBillboard::SetVtx()
{
	m_pObjBillboard->SetVtx();
}
