//==========================================================================
// 
//  ユーザー外野プレイヤーヘッダー [playerUserOut.h]
//  Author : 藤田勇一
// 
//==========================================================================

#ifndef _PLAYER_USER_OUT_
#define _PLAYER_USER_OUT_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "playerUser.h"

//==========================================================================
// クラス定義
//==========================================================================
// ユーザー外野プレイヤークラス
class CPlayerUserOut : public CPlayerUser
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CPlayerUserOut(CPlayer* pPlayer, const CPlayer::EFieldArea typeArea);
	virtual ~CPlayerUserOut() override;
};

#endif
