//==========================================================================
// 
//  プレイヤー位置補正ヘッダー [playerPosAdj.h]
//  Author : 藤田勇一
// 
//==========================================================================

#ifndef _PLAYER_POS_ADJ_H_
#define _PLAYER_POS_ADJ_H_	// 二重インクルード防止

//==========================================================================
// 前方宣言
//==========================================================================
class CPlayer;

//==========================================================================
// プレイヤー位置補正クラス定義
//==========================================================================
class CPlayerPosAdj
{
public:
	// コンストラクタ
	CPlayerPosAdj();

	// デストラクタ
	virtual ~CPlayerPosAdj() = 0;

	// 純粋仮想関数
	virtual void UpdateAdjuster(CPlayer* pPlayer) = 0;	// 調整
};

#endif
