//==========================================================================
// 
//  プレイヤー位置補正_内野コートヘッダー [playerPosAdj_in.h]
//  Author : 藤田勇一
// 
//==========================================================================

#ifndef _PLAYER_POSADJ_IN_H_
#define _PLAYER_POSADJ_IN_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "playerPosAdj.h"

//==========================================================================
// プレイヤー位置補正_内野コート定義
//==========================================================================
class CPlayerPosAdjIn : public CPlayerPosAdj
{
public:

	//=============================
	// 定数
	//=============================
	static constexpr float COMEBACK_LINE = 100.0f;	// 相手コートから戻ってくるライン

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CPlayerPosAdjIn();
	virtual ~CPlayerPosAdjIn() override;

	//=============================
	// オーバーライド関数
	//=============================
	virtual void UpdateAdjuster(CPlayer* pPlayer) override;	// 調整

protected:
	//=============================
	// 純粋仮想関数
	//=============================
	virtual bool IsLineOut(CPlayer* pPlayer) = 0;	// ライン越えフラグ取得

private:
	//=============================
	// メンバ関数
	//=============================
	void ReturnTeamCourt(CPlayer* pPlayer, const MyLib::Vector3& rPos);	// チームコート復帰
};

#endif