//==========================================================================
// 
//  AI外野プレイヤーヘッダー [playerAIOut.h]
//  Author : 藤田勇一
//  Adder  : 小笠原彪
// 
//==========================================================================

#ifndef _PLAYER_AI_OUT_
#define _PLAYER_AI_OUT_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "playerAI.h"

//==========================================================================
// クラス定義
//==========================================================================
// AI外野プレイヤークラス
class CPlayerAIOut : public CPlayerAI
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CPlayerAIOut(CPlayer* pPlayer, const CPlayer::EFieldArea typeArea);
	virtual ~CPlayerAIOut() override;

	//=============================
	// オーバーライド関数
	//=============================
	virtual CPlayerAIOut* GetPlayerAIOut() override { return nullptr; }	// AI外野プレイヤー取得
};

#endif
