//==========================================================================
// 
//  プレイヤー位置補正_左内野コートヘッダー [playerPosAdj_inLeft.h]
//  Author : 藤田勇一
// 
//==========================================================================

#ifndef _PLAYER_POSADJ_INLEFT_H_
#define _PLAYER_POSADJ_INLEFT_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "playerPosAdj_in.h"

//==========================================================================
// プレイヤー位置補正_左内野コート定義
//==========================================================================
class CPlayerPosAdjInLeft : public CPlayerPosAdjIn
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CPlayerPosAdjInLeft();
	virtual ~CPlayerPosAdjInLeft() override;

private:
	//=============================
	// オーバーライド関数
	//=============================
	virtual bool IsLineOut(CPlayer* pPlayer) override;	// ライン越えフラグ取得
};

#endif