//=============================================================================
// 
//  プレイヤーAIコントロール_移動ヘッダー [playerAIcontrol_move.h]
//  Author :Takeru Ogasawara
// 
//=============================================================================

#ifndef _PLAYERAI_CONTROL_IDLE_H_
#define _PLAYERAI_CONTROL_IDLE_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "playerAIcontrol_mode.h"

//==========================================================================
// 前方宣言
//==========================================================================
class CSuffocation;
class CEffekseerObj;
class CPlayerUserControlMove;

//==========================================================================
// プレイヤーAIコントロール_移動クラス定義
//==========================================================================
//=============================
// 移動
//=============================
class CPlayerAIControlIdle : public CPlayerAIControlMode
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CPlayerAIControlIdle();
	~CPlayerAIControlIdle();

	static CPlayerAIControlIdle* Create(CPlayer* pPlayer);

	HRESULT Init();
	void Uninit();
	void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate) override;

private:
	//=============================
	// 関数リスト
	//=============================

	//-----------------------------
	// 状態関数
	//-----------------------------

	//=============================
	// メンバ関数
	//=============================


	//=============================
	// メンバ変数
	//=============================
};


#endif