//=============================================================================
// 
//  プレイヤーコントロールヘッダー [playercontrol_action.h]
//  Author : 相馬靜雅
// 
//=============================================================================

#ifndef _PLAYERCONTROL_H_
#define _PLAYERCONTROL_H_	// 二重インクルード防止

#include "player.h"

//==========================================================================
// プレイヤーコントロールクラス定義
//==========================================================================
//=============================
// 移動
//=============================
class CPlayerControl
{
public:

	// コンストラクタ
	CPlayerControl();

	void SetPattern(CPlayer* player, CPlayer::EMotion typeM, CPlayer::EAction typeA);

private:
	
	//=============================
	// メンバ関数
	//=============================

	//=============================
	// メンバ変数
	//=============================
};


#endif