//=============================================================================
// 
//  プレイヤーステータスヘッダー [playerStatus.h]
//  Author : 相馬靜雅
// 
//=============================================================================

#ifndef _PLAYERSTATUS_H_
#define _PLAYERSTATUS_H_	// 二重インクルード防止

//==========================================================================
// 前方宣言
//==========================================================================
class CPlayer;

//==========================================================================
// プレイヤーステータスクラス
//==========================================================================
class CPlayerStatus
{
public:

	// コンストラクタ
	CPlayerStatus(CPlayer* pPlayer);

	// デストラクタ
	~CPlayerStatus();

	//=============================
	// メンバ関数
	//=============================
	void BindPlayer(CPlayer* pPlayer) { m_pPlayer = pPlayer; }	// プレイヤー割当

private:
	
	//=============================
	// メンバ変数
	//=============================
	CPlayer* m_pPlayer;	// プレイヤーのポインタ
};

#endif