//=============================================================================
// 
//  プレイヤーステータスヘッダー [playerStatus.h]
//  Author : 相馬靜雅
// 
//=============================================================================

#ifndef _PLAYERSTATUS_H_
#define _PLAYERSTATUS_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "gamemanager.h"

//==========================================================================
// 前方宣言
//==========================================================================
class CPlayer;

//==========================================================================
// プレイヤーステータスクラス
//==========================================================================
class CPlayerStatus
{
public:

	// コンストラクタ
	CPlayerStatus(CPlayer* pPlayer);

	// デストラクタ
	~CPlayerStatus();

	//=============================
	// メンバ関数
	//=============================
	void BindPlayer(CPlayer* pPlayer)	{ m_pPlayer = pPlayer; }	// プレイヤー割当
	void LifeDamage(const int nDmg);	// 体力減算
	void LifeHeal(const int nHeal);		// 体力加算

private:
	
	//=============================
	// メンバ変数
	//=============================
	CPlayer* m_pPlayer;	// プレイヤーのポインタ

	CGameManager::TeamSide m_typeTeam;	// チームサイド
	int m_nLife;	// 体力
};

#endif