//==========================================================================
// 
//  プレイヤー位置補正_エントリー用ヘッダー [playerPosAdj_entry.h]
//  Author : 相馬靜雅
// 
//==========================================================================

#ifndef _PLAYER_POSADJ_ENTRY_H_
#define _PLAYER_POSADJ_ENTRY_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "playerPosAdj.h"

//==========================================================================
// プレイヤー位置補正_内野コート定義
//==========================================================================
class CPlayerPosAdjEntry : public CPlayerPosAdj
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CPlayerPosAdjEntry();
	virtual ~CPlayerPosAdjEntry() override;

	//=============================
	// オーバーライド関数
	//=============================
	virtual void UpdateAdjuster(CPlayer* pPlayer) override;	// 調整

};

#endif