//=============================================================================
// 
//  プレイヤーコントロールヘッダー [playercontrol_action.h]
//  Author : 相馬靜雅
// 
//=============================================================================

#ifndef _PLAYERCONTROL_H_
#define _PLAYERCONTROL_H_	// 二重インクルード防止


//==========================================================================
// インクルードファイル
//==========================================================================
#include "player.h"
#include "playerBase.h"

//==========================================================================
// プレイヤーコントロールクラス定義
//==========================================================================
//=============================
// 移動
//=============================
class CPlayerControl
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CPlayerControl();
	virtual ~CPlayerControl() = 0;

	//=============================
	// メンバ関数
	//=============================
	void SetPattern(CPlayer* player, CPlayer::EMotion typeM, CPlayer::EAction typeA);	// アクション＆モーションの一括設定
};

#endif
