//==========================================================================
// 
//  プレイヤー位置補正_外野コートヘッダー [playerPosAdj_out.h]
//  Author : 藤田勇一
// 
//==========================================================================

#ifndef _PLAYER_POSADJ_OUT_H_
#define _PLAYER_POSADJ_OUT_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "playerPosAdj.h"

//==========================================================================
// プレイヤー位置補正_外野コート定義
//==========================================================================
class CPlayerPosAdjOut : public CPlayerPosAdj
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CPlayerPosAdjOut();
	virtual ~CPlayerPosAdjOut() override;

	//=============================
	// オーバーライド関数
	//=============================
	virtual void UpdateAdjuster(CPlayer* pPlayer) override;	// 調整
};

#endif