//==========================================================================
// 
//  プレイヤー位置補正_指定なしヘッダー [playerPosAdj_none.h]
//  Author : 相馬靜雅
//  Adder  : 藤田勇一
// 
//==========================================================================

#ifndef _PLAYER_POSADJ_NONE_H_
#define _PLAYER_POSADJ_NONE_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "playerPosAdj.h"

//==========================================================================
// プレイヤー位置補正_指定なし定義
//==========================================================================
class CPlayerPosAdjNone : public CPlayerPosAdj
{
public:

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CPlayerPosAdjNone();
	virtual ~CPlayerPosAdjNone() override;

	//=============================
	// オーバーライド関数
	//=============================
	virtual void UpdateAdjuster(CPlayer* pPlayer) override;	// 調整
};

#endif