//=============================================================================
// 
//  プレイヤーステータス処理 [playerStatus.cpp]
//  Author : 藤田勇一
// 
//=============================================================================
#include "playerStatus.h"

//==========================================================================
// 定数定義
//==========================================================================
namespace
{
	const int MAX_LIFE = 100;	// 最大体力
	const int MIN_LIFE = 0;		// 最小体力
}

//==========================================================================
// コンストラクタ
//==========================================================================
CPlayerStatus::CPlayerStatus(CPlayer* pPlayer) :
	m_pPlayer	(pPlayer),					// プレイヤーのポインタ
	m_typeTeam	(CGameManager::SIDE_LEFT),	// チームサイド	// TODO：CreateでPlayerの引数に追加しよう
	m_nLife		(MAX_LIFE)					// 体力
{

}

//==========================================================================
// デストラクタ
//==========================================================================
CPlayerStatus::~CPlayerStatus()
{

}

//==========================================================================
//	体力減算
//==========================================================================
void CPlayerStatus::LifeDamage(const int nDmg)
{
	// 体力を減算
	m_nLife -= nDmg;

	// 体力を補正
	UtilFunc::Transformation::ValueNormalize(m_nLife, MAX_LIFE, MIN_LIFE);
}

//==========================================================================
//	体力加算
//==========================================================================
void CPlayerStatus::LifeHeal(const int nHeal)
{
	// 体力を加算
	m_nLife += nHeal;

	// 体力を補正
	UtilFunc::Transformation::ValueNormalize(m_nLife, MAX_LIFE, MIN_LIFE);
}
