//=============================================================================
// 
//  ユーザープレイヤーヘッダー [playerUser.h]
//  Author : 藤田勇一
// 
//=============================================================================

#ifndef _PLAYER_USER_
#define _PLAYER_USER_		// 二重インクルード防止

//==========================================================================
// クラス定義
//==========================================================================
#include "player.h"

//==========================================================================
// クラス定義
//==========================================================================
// ユーザープレイヤークラス
class CPlayerUser : public CPlayer
{
public:
	
	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CPlayerUser();
	~CPlayerUser();

	//=============================
	// オーバーライド関数
	//=============================
	virtual HRESULT Init() override;
	virtual void Uninit() override;
	virtual void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate) override;
	virtual void Draw() override;

	//=============================
	// メンバ関数
	//=============================
	void Kill();	// 削除

	//=============================
	// 静的関数
	//=============================
	/*
		@brief		生成処理
		@details	必要があれば引数追加
	*/
	static CPlayerUser *Create(const int nIdx);

private:

	//=============================
	// メンバ関数
	//=============================


	//=============================
	// メンバ変数
	//=============================

};

#endif
