//==========================================================================
// 
//  スポットライトヘッダー [spotlight.h]
//  Author : 藤田勇一
// 
//==========================================================================

#ifndef _SPOT_LIGHT_H_
#define _SPOT_LIGHT_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "object.h"

//==========================================================================
// 前方宣言
//==========================================================================
class CLightPoint;

//==========================================================================
// クラス定義
//==========================================================================
// スポットライトクラス
class CSpotLight : public CObject
{
public:

	//=============================
	// 定数
	//=============================
	static constexpr int NUM_LIGHT = 4;	// ライト数

	//=============================
	// コンストラクタ/デストラクタ
	//=============================
	CSpotLight();
	~CSpotLight();

	//=============================
	// オーバーライド関数
	//=============================
	HRESULT Init() override;
	void Uninit() override;
	void Kill() override;
	void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate) override;
	void Draw() override;

	//=============================
	// 静的メンバ関数
	//=============================
	static CSpotLight* Create();

	//=============================
	// メンバ関数
	//=============================
	void SetLightPosition(const MyLib::Vector3& rPos);	// ライト位置設定

private:

	//=============================
	// メンバ変数
	//=============================
	CLightPoint* m_apLight[NUM_LIGHT];	// ライト情報
};

#endif
