//=============================================================================
// 
//  チュートリアルヘッダー [tutorial.h]
//  Author : 相馬靜雅
// 
//=============================================================================

#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_	// 二重インクルード防止

//==========================================================================
// インクルードファイル
//==========================================================================
#include "manager.h"

//==========================================================================
// 前方宣言
//==========================================================================
class CTutorialScreen;

//==========================================================================
// クラス定義
//==========================================================================
// チュートリアルクラス
class CTutorial : public CScene
{
public:

	//=============================
	// コンストラクタ,デストラクタ
	//=============================
	CTutorial();
	~CTutorial();

	//=============================
	// オーバーライド関数
	//=============================
	HRESULT Init() override;
	void Uninit() override;
	void Update(const float fDeltaTime, const float fDeltaRate, const float fSlowRate) override;
	void Draw() override;

	//=============================
	// 静的関数
	//=============================
	static CTutorial* GetInstance() { return m_pThisPtr; }	// インスタンス取得
	static CTutorial* Create();							// 生成処理

private:

	//=============================
	// メンバ変数
	//=============================
	CTutorialScreen* m_pTutorialScreen;	// チュートリアル画面
	static CTutorial* m_pThisPtr;		// 自身のポインタ
};



#endif