//=============================================================================
// 
//  エディタ―ヘッダー [edit.h]
//  Author : 相馬靜雅
// 
//=============================================================================

#ifndef _EDIT_H_
#define _EDIT_H_	// 二重インクルード防止

#include "game.h"

//==========================================================================
// クラス定義
//==========================================================================
// エディタ―クラス
class CEdit
{
public:

	CEdit();
	~CEdit();
	
	// 純粋仮想関数
	virtual HRESULT Init() = 0;
	virtual void Uninit() = 0;
	virtual void Update() = 0;

	static CEdit* Create(CGame::EditType type);	// 生成処理

private:

};

#endif