//=============================================================================
// 
//  数字処理 [number.cpp]
//  Author : 相馬靜雅
// 
//=============================================================================
#include "number.h"

// 派生先
#include "number_2D.h"
#include "number_3D.h"
#include "number_Billboard.h"

//==========================================================================
// コンストラクタ
//==========================================================================
CNumber::CNumber(int nPriority, const LAYER layer) : CObject(nPriority, layer)
{
	// 値のクリア
	m_objType = OBJECTTYPE_2D;	// オブジェクトの種類
}

//==========================================================================
// デストラクタ
//==========================================================================
CNumber::~CNumber()
{

}

//==========================================================================
// 生成処理
//==========================================================================
CNumber* CNumber::Create(EObjectType objtype, int nPriority)
{
	// 生成用のオブジェクト
	CNumber* pNumber = nullptr;

	// メモリの確保
	switch (objtype)
	{
	case CNumber::OBJECTTYPE_2D:
		pNumber = DEBUG_NEW CNumber2D(nPriority);
		break;

	case CNumber::OBJECTTYPE_3D:
		pNumber = DEBUG_NEW CNumber3D(nPriority);
		break;

	case CNumber::OBJECTTYPE_BILLBOARD:
		pNumber = DEBUG_NEW CNumberBillboard(nPriority);
		break;
	}

	if (pNumber != nullptr)
	{
		// オブジェクトの種類
		pNumber->m_objType = objtype;

		// 初期化処理
		pNumber->Init();
	}

	return pNumber;
}

//==========================================================================
// 初期化処理
//==========================================================================
HRESULT CNumber::Init()
{
	
	return S_OK;
}

//==========================================================================
// 終了処理
//==========================================================================
void CNumber::Uninit()
{
	Release();
}

//==========================================================================
// 削除
//==========================================================================
void CNumber::Kill()
{
	Release();
}

//==========================================================================
// 更新処理
//==========================================================================
void CNumber::Update()
{

}

//==========================================================================
// 描画処理
//==========================================================================
void CNumber::Draw()
{
	
}

//==========================================================================
// 種類設定
//==========================================================================
void CNumber::SetType(const CObject::TYPE type)
{
	CObject::SetType(type);
}
